# 特征工程与模型建立

In [2]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, confusion_matrix, classification_report
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [3]:
data_path='../data/train.csv'
data=pd.read_csv(data_path)
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

我们对Embarked维度做one-hot编码

In [ ]:
data['Embarked_in_C']=data['Embarked']=='C'
data['Embarked_in_S']=data['Embarked']=='S'
data['Embarked_in_Q']=data['Embarked']=='Q'
data[['Embarked_in_C','Embarked_in_S','Embarked_in_Q']]=data[['Embarked_in_C','Embarked_in_S','Embarked_in_Q']].astype(int)

   PassengerId  Survived  Pclass  ... Embarked_in_S Embarked_in_C  Embarked_in_Q
0            1         0       3  ...             1             0              0
1            2         1       1  ...             0             1              0
2            3         1       3  ...             1             0              0
3            4         1       1  ...             1             0              0
4            5         0       3  ...             1             0              0

[5 rows x 15 columns]